In [1]:
a=10 
b=20
c=a+b
print(c)

30

In [ ]:
Packeges

==============================EDA==========================================

1) pandas       :- Dataframe or data applications 
2) numpy        :- Numerical python for math operations
3) matplotlib   :- For plots graphs
4) Seaborn      :- For plots graphs 
5) Bokhe        :- For plots
6) plotly       :- For plots

======================Machine learning==========================================
    
7) Scikit learn(Sklearn)   :- Ml models
8) stats                   :- statisical models

======================Data retrival form SQl scrapping=================================

9) sqlite              :- connect with database
10) Beautiful soap     :- scrap the data from website 
11) websocket          :- scrap2

============================deep learning / Copmputer vision==============================

12) Tensorflow     :- Google
13) Keras          :- DL models
14) OpenCV         :- Image operations
15) pillow (PIL)   :- Image operation
16) Pytorch        :- Facebook
17) Pretrained model 
    VGG16
    Mobilenet
    RESNET
    MASKRCNN
    FASTERCNN
    YOLO
==============================Natural language process=================================

18) NLTk    :- natural language process
19) Scipy 
20) Word2vec(how words will convert into vactor):
21) GloVE
22) Wordcloud
====================================Hugging face=======================================

23) Transformers    :- BERT

================================GenAI model===========================================

24) OpenAI + Microsoft    :- GPT Models
25) Google                :- Gemini
26) Amazon                :- Meta AI
27) Meta Facebook         :- Q
28) Apple                 :- MetaAI
LLAMA                     
GEMMA
Dalle-E
T5

All are having different differnt packages

======================================LANGCAIN=======================================

29) LangChain Framework 

======================================Deployments=====================================

30) Flask
31) Stremalit
32) Django

======================================MLops========================================
33) Mlflow
34) Kubeflow
35) Azure Ai services : azure packages
36) GCP              : GCP packages

In [ ]:
Packeges

==============================EDA==========================================

1) pandas       :- Dataframe or data applications 
2) numpy        :- Numerical python for math operations
3) matplotlib   :- For plots graphs
4) Seaborn      :- For plots graphs 
5) Bokhe        :- For plots
6) plotly       :- For plots

======================Machine learning==========================================
    
7) Scikit learn(Sklearn)   :- Ml models
8) stats                   :- statisical models

======================Data retrival form SQl scrapping=================================

9) sqlite              :- connect with database
10) Beautiful soap     :- scrap the data from website 
11) websocket          :- scrap2

============================deep learning / Copmputer vision==============================

12) Tensorflow     :- Google
13) Keras          :- DL models
14) OpenCV         :- Image operations
15) pillow (PIL)   :- Image operation
16) Pytorch        :- Facebook
17) Pretrained model 
    VGG16
    Mobilenet
    RESNET
    MASKRCNN
    FASTERCNN
    YOLO
==============================Natural language process=================================

18) NLTk    :- natural language process
19) Scipy 
20) Word2vec(how words will convert into vactor):
21) GloVE
22) Wordcloud
====================================Hugging face=======================================

23) Transformers    :- BERT

================================GenAI model===========================================

24) OpenAI + Microsoft    :- GPT Models
25) Google                :- Gemini
26) Amazon                :- Meta AI
27) Meta Facebook         :- Q
28) Apple                 :- MetaAI
LLAMA                     
GEMMA
Dalle-E
T5

All are having different differnt packages

======================================LANGCAIN=======================================

29) LangChain Framework 

======================================Deployments=====================================

30) Flask
31) Stremalit
32) Django

======================================MLops========================================
33) Mlflow
34) Kubeflow
35) Azure Ai services : azure packages
36) GCP              : GCP packages

**Import pandas packages**

*step-1*

**Create a dataframe`**

- we will create a dataframe using list
- we will pandas a dataframe using dictionary

In [2]:
import pandas as pd

In [3]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [5]:
type(d1)

pandas.core.frame.DataFrame

*step-2*

**Provide the data**

In [6]:
names = ['tarun','surendar','mohit']
pd.DataFrame(names)

          0
0     tarun
1  surendar
2     mohit

In [9]:
#case-1
names = ['tarun','surendar','mohit']
ages=[20,21,22]
pd.DataFrame(zip(names,ages))

          0   1
0     tarun  20
1  surendar  21
2     mohit  22

In [11]:
#case-2
names = ['tarun','surendar','mohit']
ages=[20,21,22]
Data=zip(names,ages)
pd.DataFrame(Data)

          0   1
0     tarun  20
1  surendar  21
2     mohit  22

In [12]:
names = ['tarun','surendar','mohit']
ages=[20,21,22]
city=['Hyd','ECIl','Blr']
pd.DataFrame(zip(names,ages,city))

          0   1     2
0     tarun  20   Hyd
1  surendar  21  ECIl
2     mohit  22   Blr

*step-3*

**Provide the column name**

In [19]:
names = ['tarun','surendar','mohit']
pd.DataFrame(names,columns=['Names']) # column name we allways wrie in list form['']

      Names
0     tarun
1  surendar
2     mohit

In [23]:
names = ['tarun','surendar','mohit']
ages=[20,21,22]
pd.DataFrame(zip(names,ages),columns=['Names','Age'])

      Names  Age
0     tarun   20
1  surendar   21
2     mohit   22

In [72]:
names = ['tarun','surendar','mohit']
ages=[20,21,22]
city=['Hyd','ECIl','Blr']
df= pd.DataFrame(zip(names,ages,city),columns=['Names','Age','City'])
df

      Names  Age  City
0     tarun   20   Hyd
1  surendar   21  ECIl
2     mohit   22   Blr

*step-4*

**Providing indwex**

In [32]:
#case-1
names = ['tarun','surendar','mohit']
ages=[20,21,22]
city=['Hyd','ECIl','Blr']
data=zip(names,ages,city)
ix=['a','b','c']
cols=['Names','Age','City']
pd.DataFrame(data, index=ix, columns=cols)

      Names  Age  City
a     tarun   20   Hyd
b  surendar   21  ECIl
c     mohit   22   Blr

In [34]:
names = ['tarun','surendar','mohit']
ages=[20,21,22]
city=['Hyd','ECIl','Blr']
data=zip(names,ages)
cols=['Names','Age']
pd.DataFrame(data, index=city, columns=cols)

         Names  Age
Hyd      tarun   20
ECIl  surendar   21
Blr      mohit   22

In [11]:
import pandas as pd
names = ['tarun','surendar','mohit']
ages=[20,21,22]
city=['Hyd','ECIl','Blr']
pd.DataFrame(zip(ages,city),index=name,columns=['Age','City'])

          Age  City
tarun      20   Hyd
surendar   21  ECIl
mohit      22   Blr

In [13]:
name=['Bhujang','Sangita','Sarika','Komal','Jagdish']
relations=['Father','Mother','Sister','Sister','Brother']
age=[45,40,29,25,21]
pd.DataFrame(zip(name,relations,age),index=[1,2,3,4,5],columns=['Family members name','Relations','Age'])

  Family members name Relations  Age
1             Bhujang    Father   45
2             Sangita    Mother   40
3              Sarika    Sister   29
4               Komal    Sister   25
5             Jagdish   Brother   21

*Step-5*

**Add a new column on existing data frame**

In [4]:
import pandas as pd
name=['karuna','komal','Mrunali']
age=[21,20,5]
city=['hyd','jalna','pune']
pd.DataFrame(zip(name,age,city),index=[1,2,3],columns=['Name','Age','city'])

      Name  Age   city
1   karuna   21    hyd
2    komal   20  jalna
3  Mrunali    5   pune

- If you want to add a new column
- First check how many rows are there
- For example in above dataframe we have 3 rows
- Your new column also should have 3 rows
- Suppose I want to create a new column: **salary**
- make a list with 3 values
- salary=[100000,200000,300000]
- 
 **syntac** : dataframe[colum]=list of values

- salary=[100000,200000,300000]
- df['salary']=salary

In [81]:
import pandas as pd
name=['karuna','komal','Mrunali']
age=[21,20,5]
city=['hyd','jalna','pune']
df=pd.DataFrame(zip(name,age,city),index=[1,2,3],columns=['Name','Age','city'])
df

      Name  Age   city
1   karuna   21    hyd
2    komal   20  jalna
3  Mrunali    5   pune

In [83]:
salary=[100000,200000,300000]
df['salary']=salary
df

      Name  Age   city  salary
1   karuna   21    hyd  100000
2    komal   20  jalna  200000
3  Mrunali    5   pune  300000

In [1]:
import pandas as pd
name=['karuna','komal','Mrunali']
age=[21,20,5]
city=['hyd','jalna','pune']
df=pd.DataFrame(zip(name,age,city),index=[1,2,3],columns=['Name','Age','city'])
salary=[100000,200000,300000]
df['salary']=salary
df

      Name  Age   city  salary
1   karuna   21    hyd  100000
2    komal   20  jalna  200000
3  Mrunali    5   pune  300000

**Use case-1**
- create empty data frame first
- create 3 list
- lists1= a value from 1 to 10
- list2=square of 1 to 10
- list3=kcube of 1 to 10 
- finally make a dataframe

In [4]:
import pandas as pd 
df3=pd.DataFrame()
df3

Empty DataFrame
Columns: []
Index: []

In [5]:
l1=[i for i in range (1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range (1,10)]
df3['number']=l1
df3['square']=l2
df3['cube']=l3
df3

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

*step-6*

**Update the already existed column**

- create a new column

    - creating a new column the column name is our choise
- update existin coumn are same way only
- Here also we need a make a list of values= number of rows

    - while updating the existing column
    - we need to provide alreaduy existed column name only
    - df['z']=list of values

In [6]:
l3=[i**5 for i in range (1,10)]
df3['cube']=l3
df3

   number  square   cube
0       1       1      1
1       2       4     32
2       3       9    243
3       4      16   1024
4       5      25   3125
5       6      36   7776
6       7      49  16807
7       8      64  32768
8       9      81  59049

*step-7*

**Drop the column**

In [46]:
df1.columns

Index(['x', 'y', 'z', 'Z', 'A', 'k'], dtype='object')

- If you want to drop a specific column
- we will use drop method
- we already know about difference between keywords and methods
- keywords know about difference between keybords and methods
- keywords will use directly
- Methods will use with corresponding dataframe

**method name : drop**

df1.drop()
- Column: which column you want to drop
- axis: Represents the specified value is a row or column
    - axis=0 means rows 
    - axis=1 means column
    - by deafualt axis is 0
- inplace : will provide overwrite the dataframe or not
    - inplace=True, this indicates overwrite the dataframe
    - inplace=False, this indicates the modified dataframe will be use when you provide new variable for the operation

In [50]:
df1.drop('x') # we are not provideing axis
# it assuming the provided value is a row
# by default axis=0 ====

KeyError: "['x'] not found in axis"

In [57]:
df2.drop('x',axis=1)
# after this in a new cell type df1
# you will see original dataframe
# beacause we did not provide inplace

# If you want to use below output
# you need to assign a variable
# df_new axis=0 ===rows

    y    Z      k      z
0   1    1      1      1
1   4    8     32     32
2   9   27    243    243
3  16   64   1024   1024
4  25  125   3125   3125
5  36  216   7776   7776
6  49  343  16807  16807
7  64  512  32768  32768
8  81  729  59049  59049

In [69]:
df3.drop('number',axis=1,inplace=True)
df3

   square  cube
0       1     1
1       4     8
2       9    27
3      16    64
4      25   125
5      36   216
6      49   343
7      64   512
8      81   729

- Create a dataframe` #s1
- Provide the data   #s2
- Provide the column   #s3 
- Provide the column name  #s4
- Provide the index   #s5 
- Add a new column on existing data frame #s5
- Update the already existed column   #s6
- Drop the column #s7

*step-8*

**drop the row**

- drop the column and drop the rows both are similar only
- the only difference is exis 
    - axis=0 represnts rows
    - by default axis=0 available
    - which means if we provide any value, it will represent only

In [33]:
import pandas as pd
df3=pd.DataFrame()
l1=[i for i in range (1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range (1,10)]

df3['number']=l1
df3['square']=l2
df3['cube']=l3
df3

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [ ]:
df3.drop('number')
# if we run this we will get error
# by default axis=0 which represents about rows
# but 'Number' is a column

In [4]:
df3.drop(4)
# if you want to drop row, the provide the row index

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [7]:
df3.drop([4,8]) 
# multiple rows 
#multiple columns keep alwys in list

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
5       6      36   216
6       7      49   343
7       8      64   512

In [9]:
df3.drop([3,6,1])

   number  square  cube
0       1       1     1
2       3       9    27
4       5      25   125
5       6      36   216
7       8      64   512
8       9      81   729

In [11]:
df3.drop([0,1],axis=1)
# [0,1] index
# axis =1 colums
# error

KeyError: '[0, 1] not found in axis'

*step-9*

**How to select the column**

In [24]:
df3['number']  # first case
# single squer bracekt
# series type
# No column name disply
# Whenever you see this type : serise type

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: number, dtype: int64

In [21]:
type(df3['number'])

pandas.core.series.Series

In [25]:
df3[['number']] # second case
# double squaer bracekt"
# Data frame

   number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [22]:
type(df3[['number']])

pandas.core.frame.DataFrame

In [26]:
df3.number # thired case

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: number, dtype: int64

In [27]:
type(df3.number)

pandas.core.series.Series

- df3['number'] : Series type
- df3[['number']] : data frame
- df3.number : Series type

In [34]:
df3

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [35]:
col=['number','square']
df3[col]

   number  square
0       1       1
1       2       4
2       3       9
3       4      16
4       5      25
5       6      36
6       7      49
7       8      64
8       9      81

In [36]:
type(df3[col])

pandas.core.frame.DataFrame

In [37]:
df3['number'].values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

- all values comes in an array

- array means it is a list of elements only represnts using numpy package

- Generally elements present in 3 ways

    - List : Basic represntation 

    - Numpy array : Array, with Numpy package

    - Tensors : Tensorflow package

    - Torch : pytorch package

In [40]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [41]:
import numpy as np 
np.array(list1)

array([1, 2, 3, 4])

In [ ]:
tesor([1,2,3,4])

In [ ]:
# take two list 
# convert in to numpy

In [42]:
list1=[1,2,3,4]
list2=[10,20,30,40]
list1+list2

[1, 2, 3, 4, 10, 20, 30, 40]

In [43]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([11, 22, 33, 44])

In [ ]:
# 3 days every day one numpy
# A new packjage in the market : numpy
# you know python

In [47]:
df3['number'].values
# Imagine we worked on an ml problem
# we got some series of value
# Whit that series of values also we can create a datagframe

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [46]:
df3['NUMBER']=df3['number'].values
df3

   number  square  cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

*step-10*

**Who to save the data frame**

- DataFrame we can save in two formats
    
    - csv : comma seperated value
    
    - xlsx : excel format

- In order to save any data

    - Where you want to save  : directory name
    
    - What is the name of the file for storing
   
    - What is the extension
        
- We already seen same in file handling session

In [ ]:
#Case-1: Saving file at same location 
# No need to provide directory path
# Directly given only name of the file
# and extension

In [61]:
# dataframe name= df3
# save the data with index
df3.to_csv('Data1.csv')
df3.to_excel('Data1.xlsx')

*step-11*

**How to read a dataframe**

In [62]:
# read the data
import pandas as pd 
pd.read_csv('Data1.csv')

   Unnamed: 0  number  square  cube  NUMBER
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

In [51]:
pd.read_excel('Data1.xlsx')

   Unnamed: 0  number  square  cube  NUMBER
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

In [ ]:
import os
os.ge

*step-12*

**How to avoid index column**

- While we save the dataframe
    
- automaticaly a new column will create

- that we need to avoid

- Permission denied means close the data file form laptop

In [60]:
#save the data without index columns
df3.to_csv('Data1.csv',index=False)
df3.to_excel('Data1.xlsx',index=False)  # saved

In [58]:
import pandas as pd
pd.read_csv('Data1.csv') # read the file

   number  square  cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

In [59]:
pd.read_excel('Data1.xlsx') # read the file

   number  square  cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9